IDEA Open Model
ResultOnSection Class
Compatible with IDEA StatiCa 20.1
 Result of section on the member
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.ResultBase
 IdeaRS.OpenModel.Result.ResultOnSection
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ResultOnSection : ResultBase
Public Class ResultOnSection
	Inherits ResultBase
The ResultOnSection type exposes the following members.
Constructors
Name | Description
ResultOnSection
 Constructor
Top
Properties
Name | Description
AbsoluteRelative
 Absolute of relative value of position is used
Position
 Position of section
Results
 List of result of members
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace